Revit 2024 API
AirSystemData.AirFanType Property
 The fan type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public AirFanType AirFanType { get; set; }
Visual Basic
Public Property AirFanType As AirFanType
	Get
	Set
Visual C++
public:
property AirFanType AirFanType {
	AirFanType get ();
	void set (AirFanType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace